In [2]:
import pandas as pd
import numpy as np

In [3]:
# Carica il tuo dataset CSV
path = 'Churn_Modelling.csv'
df = pd.read_csv(path)

In [4]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [5]:
df['RowNumber'].nunique() == df['CustomerId'].nunique()

True

In [6]:
# Add timestamp (2023)
date_range = pd.date_range(start='2023-01-01', end='2023-12-31')

# random date for every row
num_rows = len(df)
random_dates = np.random.choice(date_range, size=num_rows)

# Aggiungiamo la colonna 'time_stamp' al DataFrame
df['event_timestamp'] = random_dates

In [7]:
cols = ['event_timestamp'] + [col for col in df if col != 'event_timestamp']
df = df[cols]
df

,event_timestamp,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,2023-01-10,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2023-07-21,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,2023-05-13,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,2023-09-13,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,2023-04-20,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,2023-10-21,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,2023-01-18,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,2023-02-07,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,2023-11-16,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,2023-05-03,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [8]:
df = df.drop(columns=['CustomerId', 'Surname'])

In [9]:
df

,event_timestamp,RowNumber,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,2023-01-10,1,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2023-07-21,2,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,2023-05-13,3,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,2023-09-13,4,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,2023-04-20,5,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,2023-10-21,9996,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,2023-01-18,9997,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,2023-02-07,9998,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,2023-11-16,9999,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,2023-05-03,10000,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [10]:
df = pd.get_dummies(df, columns=['Geography'])
df

,event_timestamp,RowNumber,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain
0,2023-01-10,1,619,Female,42,2,0.00,1,1,1,101348.88,1,True,False,False
1,2023-07-21,2,608,Female,41,1,83807.86,1,0,1,112542.58,0,False,False,True
2,2023-05-13,3,502,Female,42,8,159660.80,3,1,0,113931.57,1,True,False,False
3,2023-09-13,4,699,Female,39,1,0.00,2,0,0,93826.63,0,True,False,False
4,2023-04-20,5,850,Female,43,2,125510.82,1,1,1,79084.10,0,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,2023-10-21,9996,771,Male,39,5,0.00,2,1,0,96270.64,0,True,False,False
9996,2023-01-18,9997,516,Male,35,10,57369.61,1,1,1,101699.77,0,True,False,False
9997,2023-02-07,9998,709,Female,36,7,0.00,1,0,1,42085.58,1,True,False,False
9998,2023-11-16,9999,772,Male,42,3,75075.31,2,1,0,92888.52,1,False,True,False
9999,2023-05-03,10000,792,Female,28,4,130142.79,1,1,0,38190.78,0,True,False,False

In [11]:
df.dtypes

event_timestamp      datetime64[ns]
RowNumber                     int64
CreditScore                   int64
Gender                       object
Age                           int64
Tenure                        int64
Balance                     float64
NumOfProducts                 int64
HasCrCard                     int64
IsActiveMember                int64
EstimatedSalary             float64
Exited                        int64
Geography_France               bool
Geography_Germany              bool
Geography_Spain                bool
dtype: object

In [12]:
df.head()

,event_timestamp,RowNumber,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain
0,2023-01-10,1,619,Female,42,2,0.00,1,1,1,101348.88,1,True,False,False
1,2023-07-21,2,608,Female,41,1,83807.86,1,0,1,112542.58,0,False,False,True
2,2023-05-13,3,502,Female,42,8,159660.80,3,1,0,113931.57,1,True,False,False
3,2023-09-13,4,699,Female,39,1,0.00,2,0,0,93826.63,0,True,False,False
4,2023-04-20,5,850,Female,43,2,125510.82,1,1,1,79084.10,0,False,False,True

In [13]:
# Dividiamo il DataFrame in sotto-dataframe secondo i gruppi di colonne
essential_cols = ['event_timestamp', 'RowNumber']
demographic_cols = ['Gender', 'Age']
financial_cols = ['CreditScore', 'Tenure', 'Balance', 'EstimatedSalary']
product_cols = ['NumOfProducts', 'HasCrCard', 'IsActiveMember']
geographical_cols = ['Geography_France', 'Geography_Germany', 'Geography_Spain']
target_col = ['Exited']

data_df0 = df.loc[:, essential_cols]
data_df1 = df.loc[:, demographic_cols]
data_df2 = df.loc[:, financial_cols]
data_df3 = df.loc[:, product_cols]
data_df4 = df.loc[:, geographical_cols]
target_df = df.loc[:, target_col]

In [22]:
target_df.dtypes

Exited                      int64
event_timestamp    datetime64[ns]
RowNumber                   int64
dtype: object

In [15]:
# Adding the timestamp column to each DataFrame
data_df1 = pd.concat(objs=[data_df1, data_df0], axis=1)
data_df2 = pd.concat(objs=[data_df2, data_df0], axis=1)
data_df3 = pd.concat(objs=[data_df3, data_df0], axis=1)
data_df4 = pd.concat(objs=[data_df4, data_df0], axis=1)
target_df = pd.concat(objs=[target_df, data_df0], axis=1)
target_df.head()

   Exited event_timestamp  RowNumber
0       1      2023-01-10          1
1       0      2023-07-21          2
2       1      2023-05-13          3
3       0      2023-09-13          4
4       0      2023-04-20          5

In [16]:
data_df1.to_parquet(path='solar_power\\feature_repo\data\data_df1_2.parquet')
data_df2.to_parquet(path='solar_power\\feature_repo\data\data_df2_2.parquet')
data_df3.to_parquet(path='solar_power\\feature_repo\data\data_df3_2.parquet')
data_df3.to_parquet(path='solar_power\\feature_repo\data\data_df4_2.parquet')
target_df.to_parquet(path='solar_power\\feature_repo\data\\target_df_2.parquet')